GopalSaraf/Practicals/PSDL/include/proc/pic12lf1572.inc
// Register: PWM3LDCON
#define PWM3LDCON PWM3LDCON
PWM3LDCON                                equ 0DBFh
// bitfield definitions
PWM3LDCON_LDS_POSN                       equ 0000h
PWM3LDCON_LDS_POSITION                   equ 0000h
PWM3LDCON_LDS_SIZE                       equ 0002h
PWM3LDCON_LDS_LENGTH                     equ 0002h
PWM3LDCON_LDS_MASK                       equ 0003h
PWM3LDCON_LDT_POSN                       equ 0006h
PWM3LDCON_LDT_POSITION                   equ 0006h
PWM3LDCON_LDT_SIZE                       equ 0001h
PWM3LDCON_LDT_LENGTH                     equ 0001h
PWM3LDCON_LDT_MASK                       equ 0040h
PWM3LDCON_LDA_POSN                       equ 0007h
PWM3LDCON_LDA_POSITION                   equ 0007h
PWM3LDCON_LDA_SIZE                       equ 0001h
PWM3LDCON_LDA_LENGTH                     equ 0001h
PWM3LDCON_LDA_MASK                       equ 0080h
PWM3LDCON_PWM3LDS0_POSN                  equ 0000h
PWM3LDCON_PWM3LDS0_POSITION              equ 0000h
PWM3LDCON_PWM3LDS0_SIZE                  equ 0001h
PWM3LDCON_PWM3LDS0_LENGTH                equ 0001h
PWM3LDCON_PWM3LDS0_MASK                  equ 0001h
PWM3LDCON_PWM3LDS1_POSN                  equ 0001h
PWM3LDCON_PWM3LDS1_POSITION              equ 0001h
PWM3LDCON_PWM3LDS1_SIZE                  equ 0001h
PWM3LDCON_PWM3LDS1_LENGTH                equ 0001h
PWM3LDCON_PWM3LDS1_MASK                  equ 0002h
PWM3LDCON_PWM3LDS_POSN                   equ 0000h
PWM3LDCON_PWM3LDS_POSITION               equ 0000h
PWM3LDCON_PWM3LDS_SIZE                   equ 0002h
PWM3LDCON_PWM3LDS_LENGTH                 equ 0002h
PWM3LDCON_PWM3LDS_MASK                   equ 0003h
PWM3LDCON_PWM3LDM_POSN                   equ 0006h
PWM3LDCON_PWM3LDM_POSITION               equ 0006h
PWM3LDCON_PWM3LDM_SIZE                   equ 0001h
PWM3LDCON_PWM3LDM_LENGTH                 equ 0001h
PWM3LDCON_PWM3LDM_MASK                   equ 0040h
PWM3LDCON_PWM3LD_POSN                    equ 0007h
PWM3LDCON_PWM3LD_POSITION                equ 0007h
PWM3LDCON_PWM3LD_SIZE                    equ 0001h
PWM3LDCON_PWM3LD_LENGTH                  equ 0001h
PWM3LDCON_PWM3LD_MASK                    equ 0080h
PWM3LDCON_LDS0_POSN                      equ 0000h
PWM3LDCON_LDS0_POSITION                  equ 0000h
PWM3LDCON_LDS0_SIZE                      equ 0001h
PWM3LDCON_LDS0_LENGTH                    equ 0001h
PWM3LDCON_LDS0_MASK                      equ 0001h
PWM3LDCON_LDS1_POSN                      equ 0001h
PWM3LDCON_LDS1_POSITION                  equ 0001h
PWM3LDCON_LDS1_SIZE                      equ 0001h
PWM3LDCON_LDS1_LENGTH                    equ 0001h
PWM3LDCON_LDS1_MASK                      equ 0002h

// Register: PWM3OFCON
#define PWM3OFCON PWM3OFCON
PWM3OFCON                                equ 0DC0h
// bitfield definitions
PWM3OFCON_OFS_POSN                       equ 0000h
PWM3OFCON_OFS_POSITION                   equ 0000h
PWM3OFCON_OFS_SIZE                       equ 0002h
PWM3OFCON_OFS_LENGTH                     equ 0002h
PWM3OFCON_OFS_MASK                       equ 0003h
PWM3OFCON_OFO_POSN                       equ 0004h
PWM3OFCON_OFO_POSITION                   equ 0004h
PWM3OFCON_OFO_SIZE                       equ 0001h
PWM3OFCON_OFO_LENGTH                     equ 0001h
PWM3OFCON_OFO_MASK                       equ 0010h
PWM3OFCON_OFM_POSN                       equ 0005h
PWM3OFCON_OFM_POSITION                   equ 0005h
PWM3OFCON_OFM_SIZE                       equ 0002h
PWM3OFCON_OFM_LENGTH                     equ 0002h
PWM3OFCON_OFM_MASK                       equ 0060h
PWM3OFCON_PWM3OFS0_POSN                  equ 0000h
PWM3OFCON_PWM3OFS0_POSITION              equ 0000h
PWM3OFCON_PWM3OFS0_SIZE                  equ 0001h
PWM3OFCON_PWM3OFS0_LENGTH                equ 0001h
PWM3OFCON_PWM3OFS0_MASK                  equ 0001h
PWM3OFCON_PWM3OFS1_POSN                  equ 0001h
PWM3OFCON_PWM3OFS1_POSITION              equ 0001h
PWM3OFCON_PWM3OFS1_SIZE                  equ 0001h
PWM3OFCON_PWM3OFS1_LENGTH                equ 0001h
PWM3OFCON_PWM3OFS1_MASK                  equ 0002h
PWM3OFCON_PWM3OFM0_POSN                  equ 0005h
PWM3OFCON_PWM3OFM0_POSITION              equ 0005h
PWM3OFCON_PWM3OFM0_SIZE                  equ 0001h
PWM3OFCON_PWM3OFM0_LENGTH                equ 0001h
PWM3OFCON_PWM3OFM0_MASK                  equ 0020h
PWM3OFCON_PWM3OFM1_POSN                  equ 0006h
PWM3OFCON_PWM3OFM1_POSITION              equ 0006h
PWM3OFCON_PWM3OFM1_SIZE                  equ 0001h
PWM3OFCON_PWM3OFM1_LENGTH                equ 0001h
PWM3OFCON_PWM3OFM1_MASK                  equ 0040h
PWM3OFCON_PWM3OFS_POSN                   equ 0000h
PWM3OFCON_PWM3OFS_POSITION               equ 0000h
PWM3OFCON_PWM3OFS_SIZE                   equ 0002h
PWM3OFCON_PWM3OFS_LENGTH                 equ 0002h
PWM3OFCON_PWM3OFS_MASK                   equ 0003h
PWM3OFCON_PWM3OFMC_POSN                  equ 0004h
PWM3OFCON_PWM3OFMC_POSITION              equ 0004h
PWM3OFCON_PWM3OFMC_SIZE                  equ 0001h
PWM3OFCON_PWM3OFMC_LENGTH                equ 0001h
PWM3OFCON_PWM3OFMC_MASK                  equ 0010h
PWM3OFCON_PWM3OFM_POSN                   equ 0005h
PWM3OFCON_PWM3OFM_POSITION               equ 0005h
PWM3OFCON_PWM3OFM_SIZE                   equ 0002h
PWM3OFCON_PWM3OFM_LENGTH                 equ 0002h
PWM3OFCON_PWM3OFM_MASK                   equ 0060h
PWM3OFCON_OFS0_POSN                      equ 0000h
PWM3OFCON_OFS0_POSITION                  equ 0000h
PWM3OFCON_OFS0_SIZE                      equ 0001h
PWM3OFCON_OFS0_LENGTH                    equ 0001h
PWM3OFCON_OFS0_MASK                      equ 0001h
PWM3OFCON_OFS1_POSN                      equ 0001h
PWM3OFCON_OFS1_POSITION                  equ 0001h
PWM3OFCON_OFS1_SIZE                      equ 0001h
PWM3OFCON_OFS1_LENGTH                    equ 0001h
PWM3OFCON_OFS1_MASK                      equ 0002h
PWM3OFCON_OFM0_POSN                      equ 0005h
PWM3OFCON_OFM0_POSITION                  equ 0005h
PWM3OFCON_OFM0_SIZE                      equ 0001h
PWM3OFCON_OFM0_LENGTH                    equ 0001h
PWM3OFCON_OFM0_MASK                      equ 0020h
PWM3OFCON_OFM1_POSN                      equ 0006h
PWM3OFCON_OFM1_POSITION                  equ 0006h
PWM3OFCON_OFM1_SIZE                      equ 0001h
PWM3OFCON_OFM1_LENGTH                    equ 0001h
PWM3OFCON_OFM1_MASK                      equ 0040h

// Register: STATUS_SHAD
#define STATUS_SHAD STATUS_SHAD
STATUS_SHAD                              equ 0FE4h
// bitfield definitions
STATUS_SHAD_C_SHAD_POSN                  equ 0000h
STATUS_SHAD_C_SHAD_POSITION              equ 0000h
STATUS_SHAD_C_SHAD_SIZE                  equ 0001h
STATUS_SHAD_C_SHAD_LENGTH                equ 0001h
STATUS_SHAD_C_SHAD_MASK                  equ 0001h
STATUS_SHAD_DC_SHAD_POSN                 equ 0001h
STATUS_SHAD_DC_SHAD_POSITION             equ 0001h
STATUS_SHAD_DC_SHAD_SIZE                 equ 0001h
STATUS_SHAD_DC_SHAD_LENGTH               equ 0001h
STATUS_SHAD_DC_SHAD_MASK                 equ 0002h
STATUS_SHAD_Z_SHAD_POSN                  equ 0002h
STATUS_SHAD_Z_SHAD_POSITION              equ 0002h
STATUS_SHAD_Z_SHAD_SIZE                  equ 0001h
STATUS_SHAD_Z_SHAD_LENGTH                equ 0001h
STATUS_SHAD_Z_SHAD_MASK                  equ 0004h

// Register: WREG_SHAD
#define WREG_SHAD WREG_SHAD
WREG_SHAD                                equ 0FE5h
// bitfield definitions
WREG_SHAD_WREG_SHAD_POSN                 equ 0000h
WREG_SHAD_WREG_SHAD_POSITION             equ 0000h
WREG_SHAD_WREG_SHAD_SIZE                 equ 0008h
WREG_SHAD_WREG_SHAD_LENGTH               equ 0008h
WREG_SHAD_WREG_SHAD_MASK                 equ 00FFh

// Register: BSR_SHAD
#define BSR_SHAD BSR_SHAD
BSR_SHAD                                 equ 0FE6h
// bitfield definitions
BSR_SHAD_BSR_SHAD_POSN                   equ 0000h
BSR_SHAD_BSR_SHAD_POSITION               equ 0000h
BSR_SHAD_BSR_SHAD_SIZE                   equ 0005h
BSR_SHAD_BSR_SHAD_LENGTH                 equ 0005h
BSR_SHAD_BSR_SHAD_MASK                   equ 001Fh

// Register: PCLATH_SHAD
#define PCLATH_SHAD PCLATH_SHAD
PCLATH_SHAD                              equ 0FE7h
// bitfield definitions
PCLATH_SHAD_PCLATH_SHAD_POSN             equ 0000h
PCLATH_SHAD_PCLATH_SHAD_POSITION         equ 0000h
PCLATH_SHAD_PCLATH_SHAD_SIZE             equ 0007h
PCLATH_SHAD_PCLATH_SHAD_LENGTH           equ 0007h
PCLATH_SHAD_PCLATH_SHAD_MASK             equ 007Fh

// Register: FSR0L_SHAD
#define FSR0L_SHAD FSR0L_SHAD
FSR0L_SHAD                               equ 0FE8h
// bitfield definitions
FSR0L_SHAD_FSR0L_SHAD_POSN               equ 0000h
FSR0L_SHAD_FSR0L_SHAD_POSITION           equ 0000h
FSR0L_SHAD_FSR0L_SHAD_SIZE               equ 0008h
FSR0L_SHAD_FSR0L_SHAD_LENGTH             equ 0008h
FSR0L_SHAD_FSR0L_SHAD_MASK               equ 00FFh

// Register: FSR0H_SHAD
#define FSR0H_SHAD FSR0H_SHAD
FSR0H_SHAD                               equ 0FE9h
// bitfield definitions
FSR0H_SHAD_FSR0H_SHAD_POSN               equ 0000h
FSR0H_SHAD_FSR0H_SHAD_POSITION           equ 0000h
FSR0H_SHAD_FSR0H_SHAD_SIZE               equ 0008h
FSR0H_SHAD_FSR0H_SHAD_LENGTH             equ 0008h
FSR0H_SHAD_FSR0H_SHAD_MASK               equ 00FFh

// Register: FSR1L_SHAD
#define FSR1L_SHAD FSR1L_SHAD
FSR1L_SHAD                               equ 0FEAh
// bitfield definitions
FSR1L_SHAD_FSR1L_SHAD_POSN               equ 0000h
FSR1L_SHAD_FSR1L_SHAD_POSITION           equ 0000h
FSR1L_SHAD_FSR1L_SHAD_SIZE               equ 0008h
FSR1L_SHAD_FSR1L_SHAD_LENGTH             equ 0008h
FSR1L_SHAD_FSR1L_SHAD_MASK               equ 00FFh

// Register: FSR1H_SHAD
#define FSR1H_SHAD FSR1H_SHAD
FSR1H_SHAD                               equ 0FEBh
// bitfield definitions
FSR1H_SHAD_FSR1H_SHAD_POSN               equ 0000h
FSR1H_SHAD_FSR1H_SHAD_POSITION           equ 0000h
FSR1H_SHAD_FSR1H_SHAD_SIZE               equ 0008h
FSR1H_SHAD_FSR1H_SHAD_LENGTH             equ 0008h
FSR1H_SHAD_FSR1H_SHAD_MASK               equ 00FFh

// Register: STKPTR
#define STKPTR STKPTR
STKPTR                                   equ 0FEDh
// bitfield definitions
STKPTR_STKPTR_POSN                       equ 0000h
STKPTR_STKPTR_POSITION                   equ 0000h
STKPTR_STKPTR_SIZE                       equ 0005h
STKPTR_STKPTR_LENGTH                     equ 0005h
STKPTR_STKPTR_MASK                       equ 001Fh

